ProgessBase/DataProcessors/ПРГ_ПростановкаПризнакаБУНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПРГ_ПростановкаПризнакаБУНУ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ProgessBase/Enums/ПРГ_ВидыОперацийВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_ВидыОперацийВнутреннегоЗаказа</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СП_ЗаявкаНаПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СП_ПередачаPOSM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СП_СписаниеPOSM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявканаСИМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеОтКопекера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеККопекеру</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_СторноНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_СторноНакладной</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.ПР_Претензия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>InformationRegister.ПРГ_СписанныеТоварыДополнительный</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПередачеСоСкладов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.ПЦ_ОграничениеПоПредоставленнымСкидкам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыУСН</xr:Item>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>InformationRegister.РасчетыПоРеализацииОрганизации</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.НДСПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПередачеОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ДокументыТребующиеДопроведения</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатратРегл</xr:Item>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданныеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданныеБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладахНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.УчетПродажИСебестоимости</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.НДСВключенныйВСтоимость</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПредоставленныеСкидки</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.НДСпоОСиНМА</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ПЦ_ОграничениеОбъемаПоставки</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Претензия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПР_Претензия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АП_ДатаОплаты</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбиратьСкладВручную</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/DataProcessors/ПРГ_ПростановкаПризнакаБУНУ/Ext/ObjectModule.bsl
Процедура ПровестиВРеглУчете(ЗапускСФормы,сДата1='00010101',сДата2='00010101',Индикатор) Экспорт
	
                        //ПолучитьБлокировкуСеансов();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Представление КАК СсылкаПредставление
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|		РеализацияТоваровУслуг.Представление КАК Представление,
		|		РеализацияТоваровУслуг.Дата КАК Дата
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
		|		И РеализацияТоваровУслуг.Проведен
		|		И НЕ(РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете
		|					И РеализацияТоваровУслуг.ОтражатьВНалоговомУчете)
		|		И ((РеализацияТоваровУслуг.Сделка <> НЕОПРЕДЕЛЕНО
		|				И РеализацияТоваровУслуг.Сделка <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
		|				ИЛИ РеализацияТоваровУслуг.СП_ЗаданиеНаПодбор <> ЗНАЧЕНИЕ(Документ.Сп_ЗаданиеНаПодбор.ПустаяСсылка))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПеремещениеТоваров.Ссылка,
		|		ПеремещениеТоваров.Представление,
		|		ПеремещениеТоваров.Дата
		|	ИЗ
		|		Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|	ГДЕ
		|		ПеремещениеТоваров.Дата МЕЖДУ &Дата1 И &Дата2
		|		И ПеремещениеТоваров.Проведен
		|		И НЕ(ПеремещениеТоваров.ОтражатьВБухгалтерскомУчете
		|					И ПеремещениеТоваров.ОтражатьВНалоговомУчете)
		|		И ПеремещениеТоваров.СП_ЗаданиеНаПодбор <> ЗНАЧЕНИЕ(Документ.Сп_ЗаданиеНаПодбор.ПустаяСсылка)
		//{15.09.2015 Островерхий заявка №43926 
		|	И ВЫБОР
		|		КОГДА НЕ ПеремещениеТоваров.ВнутреннийЗаказ = ЗНАЧЕНИЕ(Документ.ВнутреннийЗаказ.ПустаяСсылка)
		|			ТОГДА НЕ ПеремещениеТоваров.ВнутреннийЗаказ.ПРГ_ВидОперации = ЗНАЧЕНИЕ(Перечисление.ПРГ_ВидыОперацийВнутреннегоЗаказа.СП_ПередачаPOSM)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		//15.09.2015 Островерхий} 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРеализации.Ссылка,
		|		КорректировкаРеализации.Представление,
		|		КорректировкаРеализации.Дата
		|	ИЗ
		|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|	ГДЕ
		|		КорректировкаРеализации.Дата МЕЖДУ &Дата1 И &Дата2
		|		И КорректировкаРеализации.Проведен
		|		И НЕ(КорректировкаРеализации.ОтражатьВБухгалтерскомУчете
		|					И КорректировкаРеализации.ОтражатьВНалоговомУчете)
		|		И КорректировкаРеализации.ПР_Претензия <> ЗНАЧЕНИЕ(Документ.ПР_Претензия.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПРГ_СторноНакладной.Ссылка,
		|		ПРГ_СторноНакладной.Представление,
		|		ПРГ_СторноНакладной.Дата
		|	ИЗ
		|		Документ.ПРГ_СторноНакладной КАК ПРГ_СторноНакладной
		|	ГДЕ
		|		ПРГ_СторноНакладной.Дата МЕЖДУ &Дата1 И &Дата2
		|		И ПРГ_СторноНакладной.Проведен
		|		И НЕ(ПРГ_СторноНакладной.ОтражатьВБухгалтерскомУчете
		|					И ПРГ_СторноНакладной.ОтражатьВНалоговомУчете)
		|		И ПРГ_СторноНакладной.Претензия <> ЗНАЧЕНИЕ(Документ.ПР_Претензия.ПустаяСсылка)) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Ссылка";

		
	ИмяСобытия = "Проведение в регл. учете";
	времяЗав  = 0;
	Если ЗапускСФормы Тогда
			Дата1 = сДата1;
			Дата2 = КонецДня(сДата2);
	Иначе
        времяЗав = 6*3600;
		Если День(ТекущаяДата()) = 1 или  День(ТекущаяДата()) = 2 Тогда
			Дата1 = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
		Иначе
			Дата1 = НачалоМесяца(ТекущаяДата());
		КонецЕсли;	
		Дата2 = НачалоДня(ТекущаяДата())-1;
		ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Информация,,,"Начало проведения c "+СокрЛП(Формат(Дата1,""))+" по "+СокрЛП(Формат(Дата2,"")));
	КонецЕсли;		
		
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", Дата2);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ПараметрыСеанса.ПроведениеДокументов = Истина;
	РаботаСОбщимиПеременными.УстановитьЗначениеПеременной("ИспользоватьВерсионированиеОбъектов", Ложь, Ложь);		
	Если ЗапускСФормы Тогда
		Индикатор.Значение = 0;
		Индикатор.МаксимальноеЗначение  = ВыборкаДетальныеЗаписи.Количество();
	КонецЕсли;	
	к = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		к = к+1;
		Если ЗапускСФормы Тогда
			Индикатор.Значение = к ;
		Иначе
			Если времяЗав <> 0 Тогда
				ТекДата = ТекущаяДата();
				Если  ТекДата  > НачалоДня(ТекДата )+ времяЗав  Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,,,"Завершение проведения документов по реглам. учету, причина закончено время!!!"+ТекДата);
					возврат;
				КонецЕсли;	
			КонецЕслИ;	
		КонецЕсли;
		
		Если к % 10 = 0 и не ЗапускСФормы Тогда
			 БлокСеанс = ПолучитьБлокировкуСеансов();
			 ТекДата = ТекущаяДатаСеанса();
			 Если БлокСеанс.Установлена Тогда
				 Если ТекДата >  БлокСеанс.Начало и ТекДата < БлокСеанс.Конец Тогда
					  ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,,,"Завершение проведения документов по реглам. учету, причина установка блокировки!!!");
					  возврат;
				 КонецЕсли; 
			 КонецЕсли; 
		КонецЕсли;	
		#Если Клиент Тогда
		 	ОбработкаПрерыванияПользователя();	
		 #КонецЕсли 
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Попытка
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		Если Объект.Проведен Тогда
			
			Объект.ОтражатьВБухгалтерскомУчете  = Истина;
			Объект.ОтражатьВНалоговомУчете      = Истина;
			
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				или ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				ЗаполнитьЗначенияСвойств(Объект, Объект.ЗаполнитьСтруктуруСчетовУчетаШапки(Истина, Истина)); 
				СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти("Товары", Объект.Товары , Объект, Объект.ОтражатьВБухгалтерскомУчете, Объект.ОтражатьВНалоговомУчете); 
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаТабличнойЧасти("Товары", Объект.Товары , Объект, Объект.ОтражатьВБухгалтерскомУчете, Объект.ОтражатьВНалоговомУчете); 
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПРГ_СторноНакладной") Тогда
			Иначе
				Если Не ЗапускСФормы Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,Объект.Метаданные(),Объект.Ссылка,"Неизвестный тип документа " + ВыборкаДетальныеЗаписи.СсылкаПредставление);
				Иначе
					Сообщить("Неизвестный тип документа " + ВыборкаДетальныеЗаписи.СсылкаПредставление);
				КонецЕсли;	
				Продолжить;;
			КонецЕсли;	
			
			Попытка
				Объект.Записать(РежимЗаписиДокумента.Проведение);	
			Исключение
				Если Не ЗапускСФормы Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,Объект.Метаданные(),Объект.Ссылка,ОписаниеОшибки());
				Иначе	
					Сообщить(Объект.Ссылка);
			    	Сообщить(ОписаниеОшибки());
				КонецЕсли;	
			КонецПопытки;
			
		 КонецЕсли;	
	 Исключение
		 	Если Не ЗапускСФормы Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,Объект.Метаданные(),Объект.Ссылка,ОписаниеОшибки());
			Иначе 
				Сообщить(Объект.Ссылка);
		    	Сообщить(ОписаниеОшибки());
			КонецЕсли;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗапускСФормы Тогда
		Индикатор.Значение = Индикатор.МаксимальноеЗначение;
	Иначе
		ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Информация,,,"Закончено проведение "+СокрЛП(Формат(Дата1,""))+" по "+СокрЛП(Формат(Дата2,"")));
    КонецЕсли;
		
	
КонецПроцедуры
